
 let x = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
 let v = [
     10,
     20,
     30,
     40,
     50,
     60,
     70,
     80,
     90,
     100,
 ]
 let i = 0;
 while (i < 10) {

     document.body.innerHTML += i + "<br />" + '<img src="shipEnemy.png" alt="image">'
     let ship = document.querySelector('img')
     i = i + 1
 }
 setInterval(move, 1000 / 60)

 let imgLeft = 0

 function move() {
     // console.log('move')
     let ships = document.querySelectorAll('img')
     ships.forEach(moveShip);

 }

 function moveShip(ship, index) {
     x[index] += Math.floor(Math.random() * 30);
     ship.style.marginLeft = x[index] + "px";
     console.log(x);
 }


/*function rectanglePerimeter (x, y) {
    return Math.sqrt(x.x*x.x+x.y*x.y);
}
length


console.log(distance({ x: 3, y: 4 }));
console.log(distance({ x: 30, y: 40 }));
console.log(distance({ x: 0, y: 0 }));
console.log(distance({ x: 1, y: 1 })) ;




Hide Task
function  is defined
rectanglePerimeter({ x: 3, y: 4, w: 5, h: 5 }) returns 20
rectanglePerimeter({ x: 0, y: 8, w: 3, h: 7 }) returns 20
rectanglePerimeter({ x: 0, y: 0, w: 0, h: 0 }) returns 0
rectanglePerimeter({ x: 10, y: 10, w: 15, h: 8 }) returns 46



document.querySelector('#img').addEventListener('click', shot);
let = 100;

function shot() (
    -= 10;
    document.querySelector('#text').innerHTML = 'Hp: ' + 
    if (=== 0) (
        alert('gameover');
    )
)
*/




























/*function console.log(x', 'y) (
    let z = Math.pow(x)+Math.pow(y);
return Math. sqrt(z);
)

const d = console.log(30', '40);
console.log(`d is $(d)`);




(function iife () (
    console.log('iife')
)());

function alone (m) (
    let y = m;
    return  function (z) (
        return z * m;
    ) 
)
console.log(alone(8));
console.log(alone(8)(9));

let letterFirstа = ['абажур', 'абонемент', 'абрикос', 'авоська', 'агрегат', 'адамант', 'аерозоль', 'азбука', 'аквамарин', 'акварель', 'акваріум', 'аксесуар', 'акумулятор', 'алкоголь', 'алмаз', 'альбом', 'альманах', 'алюміній', 'амулет', 'амуніція', 'амфетамін', 'амфібія', 'ананас', 'анкета', 'апарат', 'апельсин', 'аптечка', 'аркан', 'арт-обєкт', 'артерія', 'артефакт', 'архів', 'астероїд', 'асфальт', 'атом', 'аура', 'афродизіак',];
let letterFirstб = ['бабло', 'багаж', 'багатство', 'банан', 'банер', 'баночка', 'барабан', 'батарейка', 'батарея', 'батіг', 'бейдж', 'бензин', 'бере', 'бетон', 'бирка', 'бланк', 'блискітки', 'блокнот', 'болт', 'бомба', 'Бор', 'браслет', 'брова', 'бронь', 'брошка', 'брошура', 'бруд', 'брус', 'брюки', 'будильник', 'буква', 'буквар', 'букет', 'буклет', 'булка', 'булочка', 'булыжник', 'бумеранг', 'бурштин', 'бурян', 'буси', 'бутерброд', 'бутон', 'бухло', 'бюджет', 'бюлетень', 'бюст', 'бюстгальтер', 'Біблія', 'біжутерія', 'білизна', 'білка', 'біографія', 'бісер',];
let letterFirstв = ['вага', 'вакцина', 'Вал', 'валюта', 'вечеря', 'взуття', 'виграш', 'видобуток', 'виділення', 'вино', 'випаровування', 'виплата', 'випічка', 'виріб', 'вихованець', 'вихор', 'вихідник', 'вода', 'волос', 'воронка', 'вугілля', 'вузол', 'вулик', 'вуха', 'вухо', 'відвар', 'відкат', 'відходи', 'віза', 'вірш', 'вітамін', 'вішалка',];
let letterFirstг = ['гаджет', 'гадюка', 'газування', 'гайка', 'галантерея', 'галоші', 'галька', 'гамак', 'гаманець', 'гамбургер', 'ганчірка', 'гарантія', 'гардина', 'гармонь', 'гарнітура', 'гачок', 'гашиш', 'гвоздика', 'гель', 'гель-мастило', 'герб', 'герметик', 'героїн', 'глина', 'глист', 'глобус', 'глоток', 'глюкоза', 'гниль', 'гном', 'гніздо', 'годинник', 'голка', 'голова', 'головастик', 'головка', 'головоломка', 'голограма', 'голуб', 'горб', 'горло', 'горобець', 'горобина', 'горох', 'горошок', 'горщик', 'горілка', 'горіх', 'грааль', 'град', 'градусник', 'грак', 'грам', 'грамота', 'гранат', 'граната', 'гранд', 'грант', 'гранула', 'граніт', 'графік', 'графіка', 'графін', 'графіті', 'гребінець', 'гребінь', 'гриб', 'грибниця', 'грива', 'гривня', 'грижа', 'гризун', 'грим', 'гриф', 'гроно', 'грош', 'гроші', 'груди', 'грунт', 'груша', 'губа', 'губи', 'губка', 'гуль', 'гума', 'гусениця', 'гуща', 'гілка', 'гіпс', 'гірлянда',];
let letterFirstд = ['дар', 'датчик', 'депозит', 'деревина', 'деталь', 'джгут', 'джем', 'джинси', 'джміль', 'дзвінок', 'дзвіночок', 'дзеркальце', 'диплом', 'дисплей', 'дитинча', 'дичина', 'ДНК', 'доза', 'документ', 'долар', 'долонь', 'дохід', 'дроб', 'дрова', 'дрібниця', 'дур', 'дятел', 'діамант',];
let letterFirstе = ['евкаліпт', 'еклер', 'екліпс', 'економка', 'екран', 'екскременти', 'екстракт', 'елексир', 'електрод', 'електрон', 'електрошокер', 'емаль', 'емблема', 'ембріон', 'емульсія', 'ендорфін', 'енергетик', 'епінефрін', 'етикетка', 'еякуляція',];
let letterFirstє = ['Євангеліє', 'євро', 'євровалюта', 'європакет', 'єгер', 'єгермейстер', 'єжовник', 'єнот', 'єрж', 'єрш', 'єршик', 'єхідна',];
let letterFirstж = ['жаба', 'жайворонок', 'жакет', 'жалюзі', 'жар', 'жар-птиця', 'жасмин', 'жезл', 'желатин', 'женьшень', 'жереб', 'жесть', 'жетон', 'живопис', 'животик', 'живчик', 'жижа', 'жила', 'жилет', 'жилетка', 'жир', 'жменя', 'жнива', 'жовч', 'жовчний', 'жуйка', 'жук', 'жук-гнійник', 'жюльєн',];
let letterFirstз = ['завіса', 'завіска', 'зад', 'зайчик', 'заколка', 'закорючка', 'закуска', 'залізо', 'заліковка', 'замок', 'заначка', 'заноза', 'запал', 'запальничка', 'запах', 'записка', 'заповідь', 'заправка', 'запясті', 'зараза', 'зарплата', 'зарядка', 'засув', 'заточка', 'заєць', 'зброя', 'зелень', 'зениця', 'зефір', 'змія', 'значок', 'зошит', 'зуб', 'зілля', 'зіниця', 'зірка',];
let letterFirstи = ['имберь' , 'инджибаба', 'иржа',];
let letterFirstі = ['іграшка', 'Ізюм', 'іконка', 'ікра', 'імплант', 'іній', 'іржа', 'іскра',];
let letterFirstї = ['їжа', 'їжак-риба', 'їжачок',];
let letterFirstй = ['йо-йо', 'йогурт', 'йод', 'йоржик', 'Йорк', 'йоркшир-терєр',];
let letterFirstк = ['кабель', 'каблук', 'кавун', 'камера', 'Камінь', 'канат', 'канди', 'капсула', 'капуста', 'капюшон', 'капітал', 'карикатура', 'каркас', 'кароп', 'карта', 'картинка', 'картка', 'картопля', 'каталог', 'качка', 'каша', 'квасоля', 'квиток', 'квітка', 'кекс', 'келих', 'килимок', 'кинжал', 'кишеня', 'клаптик', 'клей', 'клеймо', 'ключ', 'книга', 'ковпак', 'кокаїн', 'колода', 'ком', 'комар', 'комок', 'компромат', 'комікс', 'конверт', 'коник', 'конопля', 'конспект', 'концентрат', 'копія', 'кора', 'коржик', 'корм', 'коробка', 'корона', 'корінь', 'коса', 'косар', 'косметика', 'костюм', 'косяк', 'кошеня', 'краватка', 'крапля', 'крем', 'крила', 'кристал', 'крихта', 'кришталь', 'кров', 'кролик', 'кросівок', 'кукла', 'кулак', 'Кулон', 'куля', 'купальник', 'купон', 'купюра', 'куриця', 'куртка', 'куш', 'кущ', 'кіготь', 'кільце', 'кістка', 'кіт',];
let letterFirstл = ['ладан', 'лампочка', 'ланка', 'ланцюжок', 'ласо', 'ластик', 'ластівка', 'латка', 'лебідка', 'лебідь', 'лелека', 'лемур', 'лимон', 'лимонад', 'липучка', 'лист', 'листок', 'листівка', 'личинка', 'лопатка', 'лосини', 'лосось', 'лосьйон', 'лощина', 'лужок', 'луска', 'лушпиння', 'льодяник', 'лялька', 'лящ', 'лінза', 'лінійка', 'літр', 'ліфчик', 'ліхтарик', 'ліщина',];
let letterFirstм = ['магазин', 'магніт', 'мазь', 'майка', 'макарони', 'малина', 'малюнок', 'мантія', 'марихуана', 'мармур', 'маска', 'масло', 'мед', 'медуза', 'мембрана', 'менструація', 'мережі', 'мерка', 'мерч', 'метелик', 'мило', 'миша', 'мобильник', 'мова', 'мозок', 'мозоль', 'молекула', 'молюск', 'монета', 'морепродукт', 'морковка', 'морозиво', 'мотузка', 'мох', 'мочалка', 'мочі', 'мошонка', 'мука', 'мундир', 'мурашка', 'мурашник', 'муха', 'мякоть', 'мясо', 'мяч', 'мікроб', 'мікрофон', 'мірило', 'мішок',];
let letterFirstн = ['навушник', 'надра', 'нажива', 'наказ', 'напій', 'нарцис', 'нафта', 'нерви', 'нитка', 'нота', 'ніж', 'ніс', 'ніштяк',];
let letterFirstо = ['обгортка', 'оберіг', 'облицьовування', 'оболонка', 'обід', 'овощ', 'одяг', 'ожина', 'окови', 'окурок', 'олівець', 'оплата', 'орган', 'осад', 'останки', 'отрута', 'оцет', 'очі',];
let letterFirstп = ['пакет', 'палець', 'палиця', 'панчоха', 'папір', 'паразит', 'пастка', 'пелюстка', 'пенал', 'Пензель', 'перли', 'перлина', 'пиво', 'пил', 'писка', 'план', 'пластівці', 'плата', 'платіж', 'пляшка', 'плід', 'повітря', 'подарунок', 'податок', 'подушка', 'попа', 'порцеляна', 'прапор', 'премія', 'препарат', 'протокол', 'птах', 'пухлина', 'підробка', 'підручник', 'пісок',];
let letterFirstр = ['радіація', 'радіо', 'рама', 'рамен', 'рамка', 'рахунок', 'рейдер', 'ремінь', 'речовина', 'реєстр', 'риба', 'робка', 'родимка', 'розетка', 'розєм', 'ромашка', 'роса', 'роутер', 'рукопис', 'рукоятка', 'рулон', 'рюкзак', 'рюмка', 'ріг', 'рідина', 'річ',];
let letterFirstс = ['салют', 'світильник', 'свічка', 'сертифікат', 'серце', 'сеча', 'сигарета', 'сир', 'сироп', 'сиська', 'словник', 'сльоза', 'смарагд', 'смартфон', 'сніг', 'сніжинка', 'сорочка', 'сосок', 'спадщина', 'справа', 'спідниця', 'срібло', 'стаття', 'стегна', 'стик', 'струм', 'стріли', 'стрінги', 'субсидія', 'сувенір', 'судина', 'сумка', 'суміш', 'сфера', 'схема', 'схованка', 'сюрприз', 'сік', 'сіль',];
let letterFirstт = ['таблетка', 'талон', 'талісман', 'тапки', 'тарган', 'тарілка', 'тварина', 'телеграма', 'телефон', 'тент', 'термометр', 'тертка', 'тест', 'тесто', 'тирамісу', 'токсин', 'толстовка', 'топаз', 'топік', 'тост', 'тотем', 'трава', 'трекер', 'трикотаж', 'трофей', 'троянда', 'трубка', 'трубочка', 'труси', 'трутень', 'тумблер', 'туфля', 'тюбик', 'тюльпан', 'тютюн', 'тінь',];
let letterFirstу = ['указ', 'уламки', 'уламок', 'уніформа', 'уста', 'устав',];
let letterFirstф = ['фаберже', 'фазан', 'файл', 'фаланга', 'фантик', 'фарба', 'фартух', 'фарш', 'фаст-фуд', 'фата', 'фекалії', 'фенечка', 'ферзь', 'феромон', 'флейта', 'флешка', 'фольга', 'фоліант', 'форель', 'фосфор', 'фотознімок', 'фотокарточка', 'фотоплівка', 'фреон', 'фрукт', 'фужер', 'фундук', 'футболка', 'фіалка', 'фігура', 'фігурка', 'фікус', 'філе', 'філин', 'фінанси', 'фінка', 'фінік', 'фісташка', 'фішка',];
let letterFirstх = ['хайлайтер', 'халва', 'хамелеон', 'харчок', 'харчування', 'хер', 'хлам', 'хлист', 'хлопушка', 'хлороформ', 'хліб', 'хлібці', 'холка', 'хомячок', 'хрест', 'хрестик', 'хробак', 'хром', 'хромосома', 'хронометр', 'хрін', 'худи', 'хурма', 'хутро', 'хіджаб', 'хімікат', 'хінкалі',];
let letterFirstц = ['цвях', 'целофан', 'целюліт', 'цемент', 'цент', 'цибуля', 'цикада', 'цинк', 'циркуль', 'цитрус', 'циферблат', 'цоколь', 'цукерка', 'цукор', 'цуценя', 'цуцик', 'ціанід', 'ціль', 'цінник',];
let letterFirstч = ['часник', 'частина', 'чача', 'чаша', 'чашечка', 'чашка', 'чебурек', 'чека', 'чепчик', 'червяк', 'черевики', 'черево', 'черепашка', 'черешня', 'чернетка', 'чертеж', 'чижик', 'чизбургер', 'чизкейк', 'чорнила', 'чорнильниця', 'чорниця', 'чорнозем', 'чорнослив', 'чучело', 'чіпси',];
let letterFirstш = ['шагомер', 'шампанське', 'шампунь', 'шампіньйон', 'шантаж', 'шапочка', 'шарлотка', 'шарнір', 'шарф', 'шаурма', 'шашка', 'шашлик', 'шерсть', 'шершень', 'шестерня', 'шишка', 'шкіра', 'шлунок', 'шльопанці', 'шматок', 'шницель', 'шнурок', 'шовк', 'шовковиця', 'шокер', 'шоколад', 'шпаргалка', 'шпилька', 'штани', 'штатив', 'штекер', 'штик', 'шторка', 'штукатурка',];
let letterFirstщ = ['щебеня', 'щебінь', 'щелепа', 'щербет', 'щипці', 'щоденник', 'щука', 'щупальце', 'щур', 'щіка', 'щіпка',];
let letterFirstю = ['юань', 'ювелірка', 'юла', 'юппі', 'юфта', 'юшка',];
let letterFirstя = ['яблуко', 'явка', 'язичок', 'яйце', 'ялина', 'ялинка', 'ярлик', 'яструб', 'яєчня',];
let massive = letterFirstв.pop();
console.log(massive);
*/